

#include <iostream>
#include <stdio.h>
void Swap(int* pa, int* pb);
int main()
{
	int a , b;
	scanf_s("%d", &a);
	scanf_s("%d", &b);
	Swap( &a , &b);
	printf("%d %d", a, b);

}
void Swap(int* pa, int* pb) {
	int temp;
    temp = *pb;
	*pb = *pa;
	*pa = temp;
}

// Общия вид на структурите ,операция със структури -> , какс се осъществява доступ до елемент от структури ;
//Определение за указател ,общ вид на дефиницията (как се дефинира),напишете програмен ред които дефинира 3 указателя кум тип инт 
// какво е масив , опр,общ вуд на масива ,цикли деиствие мна whiwe do while,иф елсе проверка ,меню за избор слич каисе , 
//функции какво е прототип на функция , форматен спецификатор %Х %х,логически оператори && || & ,kolko zaema wseki wid danni , kak se deфинират 
//константи ,